# a - открытие для добавления данных. Позволяет дописывать что-то в
# имеющийся файл Если файла нет, то создаст

# r - открытие для чтения данных. Позволяет читать данные из файла. Если
# файла нет, то выдаст ошибку.

# w - открытие для записи данных. Позволяет записывать данные и создавать
# файл, если его нет.

# w+ - позволдяет открывать файл для записи и читать и него. Если файла нет,
# то создаст

# r+ - позволяет открывать файл для чтения и дописывать в него. Если файла
# нет, то выдаст ошибку.




# colors = ['red', '1234123', 'blue']
# data = open('file.txt', 'a', encoding='utf-8')
# data.writelines(colors)
# data.close()

# with open('file.txt', 'w') as data:
#     data.write('line 1\n')
#     data.write('line 2\n')


# path = 'file.txt'
# data = open('file.txt', 'r')
# for line in data:
#     print(line)
# data.close()

